In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.sort_values('First Name', inplace = True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2022-03-12 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2022-03-12 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2022-03-12 14:53:00,52119,11.343,True,Client Services

In [14]:
mask = ~df['First Name'].duplicated(keep = False)
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
8,Angela,Female,2005-11-22,2022-03-12 06:29:00,95570,18.523,True,Engineering
688,Brian,Male,2007-04-07,2022-03-12 22:47:00,93901,17.821,True,Legal
190,Carol,Female,1996-03-19,2022-03-12 03:39:00,57783,9.129,False,Finance
887,David,Male,2009-12-05,2022-03-12 08:48:00,92242,15.407,False,Legal
5,Dennis,Male,1987-04-18,2022-03-12 01:35:00,115163,10.125,False,Legal
495,Eugene,Male,1984-05-24,2022-03-12 10:54:00,81077,2.117,False,Sales
33,Jean,Female,1993-12-18,2022-03-12 09:07:00,119082,16.180,False,Business Development
832,Keith,Male,2003-02-12,2022-03-12 15:02:00,120672,19.467,False,Legal
291,Tammy,Female,1984-11-11,2022-03-12 10:30:00,132839,17.463,True,Client Services